
单设备单点登陆,实现思路.

实施目标:
通信校验,避免跨用户非授权调用.
实施方式:
用户登陆校验密码成功,下发随机指纹,把指纹与token做一一对应,然后存储在服务端,用户通信过程中,需要出示token,如果token正确并且与用户对应,则授权访问.否则提示鉴权失败.

实施难点:
1.不被枚举?[存redis,因为一个用户,只有一个key,它对应就只有一个token];
2.如何实现多端多用户的登陆?[从app跳转到pc如何实现,是否使用同一token]
3.token是否需要回收或过期.[是的,因为token不过期的话,它是明文通信的,不安全]
4.如何确保token足够安全?[每次登陆都生成,随机的token长度32位,不可枚举]
5.如何提高用户体验?[每次登陆时采集用户的设备,网络等信息,以开展人性化提示]
6.如何实时通知用户鉴权失效.[主动方式:短信,微信,推送;被动方式:页面刷新拉取]

问题解答:
为什么采集指纹校验的方式,它是明文的,安全性是否足够?
因为移动设备,对带宽的要求很高,设备做解密运算需要耗费很大内存,采集指纹校验可以提高网络带宽利用率,减少对用户设备的内存占用,提升用户体验.
如果通信内容保密等级要求比较高,可以采用des双向不对称加密方案.

当前方案是否还有优化的空间:
有,通信校验方式仍然采集指纹校验,但是通信方式可以从http改成直接socket通信,一来,socket通信抓包不方便,二来,它的解密成本>解密所得,它从根本上杜绝了被破解的可能.


锋子
2015年4月2日 18:14:42

