-- Adminer 3.7.1 MySQL dump

SET NAMES utf8;
SET foreign_key_checks = 0;
SET time_zone = '+08:00';
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `ddys_ask_special`;
CREATE TABLE `ddys_ask_special` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '自增主键',
  `pid` bigint(20) NOT NULL COMMENT '父级评论id',
  `content` text NOT NULL COMMENT '评论内容',
  `create_at` int(11) NOT NULL COMMENT '评论时间',
  `update_at` bigint(20) NOT NULL COMMENT '更新时间',
  `status` tinyint(1) NOT NULL COMMENT '状态[-1删除1正常]',
  `user_id` bigint(20) NOT NULL COMMENT '评论者用户id',
  `count_view` bigint(20) NOT NULL COMMENT '浏览次数',
  `count_comment` bigint(20) NOT NULL COMMENT '评论数',
  `is_buy` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否需要付费',
  `price` decimal(8,2) NOT NULL DEFAULT '0.00' COMMENT '价格',
  PRIMARY KEY (`id`),
  KEY `pid` (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='专家问答内容列表';

INSERT INTO `ddys_ask_special` (`id`, `pid`, `content`, `create_at`, `update_at`, `status`, `user_id`, `count_view`, `count_comment`, `is_buy`, `price`) VALUES
(6,	8,	'断奶是一件比较痛苦的过程,这时候的宝宝已经习惯了母乳喂养,还不完全习惯改吃其 他食品,一般反应都是又哭又吵,会让爸爸妈妈们非常烦躁。',	1470207541,	1470207541,	1,	1,	0,	0,	1,	0.00),
(7,	12,	'断奶是一件比较痛苦的过程,这时候的宝宝已经习惯了母乳喂养,还不完全习惯改吃其 他食品,一般反应都是又哭又吵,会让爸爸妈妈们非常烦躁。',	1470207547,	1470207547,	1,	1,	0,	0,	0,	0.00),
(8,	0,	'这个很简单呀,这个真不知道耶',	1470275813,	1470388794,	1,	1,	36,	10,	1,	0.01),
(12,	0,	'什么是世界上最大的月饼?',	1470369189,	1470388123,	1,	1,	0,	2,	0,	0.00),
(55,	8,	'你好回复',	1470378004,	1470378004,	1,	37,	0,	0,	0,	0.00),
(56,	8,	'嘿幽幽,嘿哈哈,嘿嘿 嘿',	1470378066,	1470378066,	1,	37,	0,	0,	0,	0.00),
(57,	8,	'我回答,我骄傲,',	1470378510,	1470378510,	1,	37,	0,	0,	0,	0.00),
(58,	8,	'dfsfdssdf',	1470383393,	1470383393,	1,	37,	0,	0,	0,	0.00),
(59,	8,	'sadadad',	1470383419,	1470383419,	1,	37,	0,	0,	0,	0.00),
(60,	8,	'deq',	1470383424,	1470383424,	1,	37,	0,	0,	0,	0.00),
(61,	8,	'sdffdsds',	1470383428,	1470383428,	1,	37,	0,	0,	0,	0.00),
(62,	8,	'sdfsfs',	1470383452,	1470383452,	1,	37,	0,	0,	0,	0.00),
(63,	8,	'sdfsds',	1470383457,	1470383457,	1,	37,	0,	0,	0,	0.00),
(64,	8,	'sdfss',	1470383479,	1470383479,	1,	37,	0,	0,	0,	0.00),
(65,	8,	'哈哈',	1470383485,	1470383485,	1,	37,	0,	0,	0,	0.00),
(66,	8,	'你好呀',	1470383495,	1470383495,	1,	37,	0,	0,	0,	0.00),
(67,	8,	'嘻嘻哈哈,ok',	1470383738,	1470383738,	1,	37,	0,	0,	0,	0.00),
(68,	12,	'居然是讨论 吃的问题.',	1470383842,	1470383842,	1,	37,	0,	0,	0,	0.00),
(69,	12,	'吃吃吃,俺强项呐',	1470383859,	1470383859,	1,	37,	0,	0,	0,	0.00),
(70,	8,	'你好,世界',	1470384012,	1470384012,	1,	37,	0,	0,	0,	0.00),
(71,	8,	'世界,你好',	1470384019,	1470384019,	1,	37,	0,	0,	0,	0.00),
(72,	8,	'hello world',	1470384029,	1470384029,	1,	37,	0,	0,	0,	0.00),
(73,	8,	'什么是世界上最大的月饼?',	1470386672,	1470386672,	1,	1,	0,	0,	0,	0.00),
(74,	8,	'什么是世界上最大的月饼?',	1470386707,	1470386707,	1,	1,	0,	0,	0,	0.00),
(75,	8,	'什么是世界上最大的月饼?',	1470386722,	1470386722,	1,	1,	0,	0,	0,	0.00),
(76,	8,	'什么是世界上最大的月饼?',	1470386733,	1470386733,	1,	1,	0,	0,	0,	0.00),
(77,	8,	'什么是世界上最大的月饼?',	1470386736,	1470386736,	1,	1,	0,	0,	0,	0.00),
(78,	8,	'什么是世界上最大的月饼?',	1470386751,	1470386751,	1,	1,	0,	0,	0,	0.00),
(79,	8,	'什么是世界上最大的月饼?',	1470386771,	1470386771,	1,	1,	0,	0,	0,	0.00),
(80,	8,	'什么是世界上最大的月饼?',	1470386772,	1470386772,	1,	1,	0,	0,	0,	0.00),
(81,	8,	'什么是世界上最大的月饼?',	1470386774,	1470386774,	1,	1,	0,	0,	0,	0.00),
(82,	8,	'楼下,保持队形.',	1470386901,	1470386901,	1,	37,	0,	0,	0,	0.00),
(83,	0,	'sdffdsfsds',	1470387129,	1470387129,	1,	37,	13,	4,	0,	0.00),
(84,	0,	'问,月亮为什么那么圆?',	1470387151,	1470388533,	1,	37,	6,	2,	0,	0.00),
(85,	84,	'因为三宝呀,吉祥',	1470387164,	1470387164,	1,	37,	0,	0,	0,	0.00),
(86,	83,	'快来买呀,小朋友们,你们好呀.',	1470387311,	1470387311,	1,	37,	0,	0,	0,	0.00),
(87,	83,	'说人话.',	1470387381,	1470387381,	1,	37,	0,	0,	0,	0.00),
(88,	83,	'rgere',	1470387471,	1470387471,	1,	37,	0,	0,	0,	0.00),
(89,	83,	'咱们老百姓啊,今个儿真高兴.',	1470387886,	1470387886,	1,	37,	0,	0,	0,	0.00),
(90,	0,	'什么是世界上最大的月饼?',	1470388037,	1470388521,	1,	1,	3,	1,	0,	0.00),
(91,	12,	'什么是世界上最大的月饼?',	1470388039,	1470388039,	1,	1,	0,	0,	0,	0.00),
(92,	12,	'什么是世界上最大的月饼?',	1470388123,	1470388123,	1,	1,	0,	0,	0,	0.00),
(93,	90,	'没吃过.',	1470388521,	1470388521,	1,	37,	0,	0,	0,	0.00),
(94,	84,	'你真逗',	1470388533,	1470388533,	1,	37,	0,	0,	0,	0.00),
(95,	8,	'据今天去香港参加恒大中报业绩会的媒体反馈：恒大严正回应，该消息为假消息，没有这回事儿，正在跟财新沟通。  一时间，市场上对财新所谓的“虚假新闻”开始喊打喊杀。  否认也并没有什么卵用，万科依然还在上涨。谁买并不重要，价值就在那里，看好地产板块的游资和散户蜂拥而至，迅速推至涨停。  下午3点刚刚收盘，腾讯财经又发布了反转消息：“ 恒大撤回否认买入万科的说法，并称公司正在拟写正式回应公告。”  随后，第一财经爆料称，恒大今日买入万科股票，持股比例预计占万科的5%左右，涉及的资金数额预计超过恒大市值的10%。  整个市场都目瞪口呆。',	1470388794,	1470388794,	1,	37,	0,	0,	0,	0.00),
(96,	0,	'什么是世界上最大的月饼?',	1470394794,	1470395297,	1,	1,	7,	1,	0,	0.00),
(97,	96,	'不会都要钱吧,这是什么情况.',	1470395297,	1470395297,	1,	37,	0,	0,	0,	0.00);

-- 2016-08-05 19:35:13
